``atlas`` choice of coordinates
========================================

Simple roots for ``SL(5,R)``
----------------------------

How do we interpret the way the software writes the simple roots for ``SL(n,R)``? Let us look at an example::

    atlas> set G= SL(5,R)
    Identifier G: RealForm (hiding previous one of type RealForm)
    atlas> simple_roots(G)
    Value:
    | 1, 0, 0, 1 |
    | -1, 1, 0, 1 |
    | 0, -1, 1, 1 |
    | 0, 0, -1, 2 |
    atlas> simple_coroots(G)
    Value:
    | 1, 0, 0, 0 |
    | -1, 1, 0, 0 |
    | 0, -1, 1, 0 |
    | 0, 0, -1, 1 |
    atlas> rho(G)
    Value: [ 4, 3, 2, 1 ]/1
    atlas>sum(simple_roots(G))
    Value: [ 2, 1, 1, 1 ]
    atlas>

So, atlas chooses a set of coordinates to work with. They were chosen
in the "roots.at" file so that the matrix of the simple_coroots for
the simply connected group is the identity matrix::

    atlas> set g=LieType: A4
    Identifier g: LieType (hiding previous one of type LieType)
    atlas> set rd=simply_connected(A4)
    Identifier rd: RootDatum (hiding previous one of type RootDatum)
    atlas> rd
    Value: simply connected root datum of Lie type 'A4'

    atlas> simple_coroots (rd)
    Value: 
    | 1, 0, 0, 0 |
    | 0, 1, 0, 0 |
    | 0, 0, 1, 0 |
    | 0, 0, 0, 1 |
    
    atlas>

But look what happens when we type::

    atlas> G:=SU(5)
    Value: compact connected real group with Lie algebra 'su(5)'
    atlas> simple_coroots (G)
    Value: 
    |  1,  0,  0, 0 |
    | -1,  1,  0, 0 |
    |  0, -1,  1, 0 |
    |  0,  0, -1, 1 |
    
    atlas>

If you want to ask atlas about a vector in the Cartan or say an
infinitesimal character, you need to write it in terms of the simple
roots. Then the software will give you the vector in terms of the ``atlas``
coordinates. For example:

atlas> rho(rd)
Value: [ 1, 1, 1, 1 ]/1
atlas> rho(G)
Value: [ 4, 3, 2, 1 ]/1
atlas> sum(simple_roots (G))
Value: [ 2, 1, 1, 1 ]
atlas>sum(simple_roots (rd))
Value: [ 1, 0, 0, 1 ]
atlas> 